Tekla Open API Reference for Tekla Structures 2025
StringList.IndexOf Method (String, Int32)
 Gets the index of the specified string between the index to start the search from and the end of the list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int IndexOf(
	string value,
	int startIndex
)
Public Function IndexOf (
	value As String,
	startIndex As Integer
) As Integer
Parameters
value
Type: System.String
The string to locate in the list.
startIndex
Type: System.Int32
The index to start the search from.
Return Value
Type: Int32
The index of the string if found in the list, otherwise -1.
See Also
Reference
StringList Class
IndexOf Overload
Tekla.Structures.Drawing Namespace